In [1]:
import pandas as pd

In [ ]:
# Create table If Not Exists World (name varchar(255), continent varchar(255), area int, population int, gdp bigint)
# Truncate table World
# insert into World (name, continent, area, population, gdp) values ('Afghanistan', 'Asia', '652230', '25500100', '20343000000')
# insert into World (name, continent, area, population, gdp) values ('Albania', 'Europe', '28748', '2831741', '12960000000')
# insert into World (name, continent, area, population, gdp) values ('Algeria', 'Africa', '2381741', '37100000', '188681000000')
# insert into World (name, continent, area, population, gdp) values ('Andorra', 'Europe', '468', '78115', '3712000000')
# insert into World (name, continent, area, population, gdp) values ('Angola', 'Africa', '1246700', '20609294', '100990000000')


#big -  a >= 3000000
#       p>= 25000000

In [2]:
data = [['Afghanistan', 'Asia', 652230, 25500100, 20343000000], ['Albania', 'Europe', 28748, 2831741, 12960000000], ['Algeria', 'Africa', 2381741, 37100000, 188681000000], ['Andorra', 'Europe', 468, 78115, 3712000000], ['Angola', 'Africa', 1246700, 20609294, 100990000000]]
world = pd.DataFrame(data, columns=['name', 'continent', 'area', 'population', 'gdp']).astype({'name':'object', 'continent':'object', 'area':'Int64', 'population':'Int64', 'gdp':'Int64'})

In [17]:
world

          name continent     area  population           gdp
0  Afghanistan      Asia   652230    25500100   20343000000
1      Albania    Europe    28748     2831741   12960000000
2      Algeria    Africa  2381741    37100000  188681000000
3      Andorra    Europe      468       78115    3712000000
4       Angola    Africa  1246700    20609294  100990000000

In [14]:
world.loc[2:3 ,['name','population','area']]

      name  population     area
2  Algeria    37100000  2381741
3  Andorra       78115      468

In [24]:
world.iloc[: , 2:4]

      area  population
0   652230    25500100
1    28748     2831741
2  2381741    37100000
3      468       78115
4  1246700    20609294

In [25]:
world.loc[0, :]

name          Afghanistan
continent            Asia
area               652230
population       25500100
gdp           20343000000
Name: 0, dtype: object